{
  "<PAD>": 0,
  "<START>": 1,
  "<END>": 2,
  "<UNK>": 3,
  "(anemo)": 4,
  "(anemo),": 5,
  "(anemo)?": 6,
  "(dendro)": 7,
  "(dendro),": 8,
  "(dendro)?": 9,
  "(electro)": 10,
  "(electro),": 11,
  "(electro)?": 12,
  "(geo)": 13,
  "(geo),": 14,
  "(geo)?": 15,
  "(hydro)": 16,
  "(hydro),": 17,
  "(hydro)?": 18,
  "(pyro)": 19,
  "(pyro),": 20,
  "(pyro)?": 21,
  "(unaligned)": 22,
  "(unaligned),": 23,
  "(unaligned)?": 24,
  ",": 25,
  ".": 26,
  "0★": 27,
  "1★": 28,
  "23.": 29,
  "2★": 30,
  "33.": 31,
  "38.": 32,
  "39.": 33,
  "3★": 34,
  "40.": 35,
  "41.": 36,
  "42.": 37,
  "43.": 38,
  "44.": 39,
  "45.": 40,
  "46.": 41,
  "48.": 42,
  "49.": 43,
  "4★": 44,
  "5★": 45,
  "a": 46,
  "a-thousand-floating-dreams": 47,
  "about": 48,
  "aether": 49,
  "aether,": 50,
  "aether?": 51,
  "akuoumaru": 52,
  "albedo": 53,
  "albedo,": 54,
  "albedo?": 55,
  "alhaitham": 56,
  "alhaitham,": 57,
  "alhaitham?": 58,
  "alley-hunter": 59,
  "aloy": 60,
  "aloy,": 61,
  "aloy?": 62,
  "amber": 63,
  "amber,": 64,
  "amber-catalyst": 65,
  "amber?": 66,
  "amenoma-kageuchi": 67,
  "amos-bow": 68,
  "and": 69,
  "apprentice-s-notes": 70,
  "aqua-simulacra": 71,
  "aquila-favonia": 72,
  "arataki": 73,
  "arlecchino": 74,
  "arlecchino,": 75,
  "arlecchino?": 76,
  "artifacts": 77,
  "atk": 78,
  "atk,": 79,
  "ayaka": 80,
  "ayaka,": 81,
  "ayaka?": 82,
  "ayato": 83,
  "ayato,": 84,
  "ayato?": 85,
  "baizhu": 86,
  "baizhu,": 87,
  "baizhu?": 88,
  "ballad-of-the-boundless-blue": 89,
  "ballad-of-the-fjords": 90,
  "barbara": 91,
  "barbara,": 92,
  "barbara?": 93,
  "base": 94,
  "beacon-of-the-reed-sea": 95,
  "beginner-s-protector": 96,
  "beidou": 97,
  "beidou,": 98,
  "beidou?": 99,
  "bennett": 100,
  "bennett,": 101,
  "bennett?": 102,
  "best": 103,
  "black-tassel": 104,
  "blackcliff-agate": 105,
  "blackcliff-amulet": 106,
  "blackcliff-longsword": 107,
  "blackcliff-pole": 108,
  "blackcliff-slasher": 109,
  "blackcliff-warbow": 110,
  "bloodtainted-greatsword": 111,
  "bow": 112,
  "build": 113,
  "by": 114,
  "calamity-queller": 115,
  "candace": 116,
  "candace,": 117,
  "candace?": 118,
  "cashflow-supervision": 119,
  "catalyst": 120,
  "category:crossover": 121,
  "category:event-exclusive": 122,
  "category:non-wish": 123,
  "category:playable": 124,
  "category:standard": 125,
  "character": 126,
  "characters": 127,
  "characters,": 128,
  "characters?": 129,
  "charlotte": 130,
  "charlotte,": 131,
  "charlotte?": 132,
  "chasca": 133,
  "chasca,": 134,
  "chasca?": 135,
  "chevreuse": 136,
  "chevreuse,": 137,
  "chevreuse?": 138,
  "chiori": 139,
  "chiori,": 140,
  "chiori?": 141,
  "chongyun": 142,
  "chongyun,": 143,
  "chongyun?": 144,
  "cinnabar-spindle": 145,
  "citlali": 146,
  "citlali,": 147,
  "citlali?": 148,
  "claymore": 149,
  "clorinde": 150,
  "clorinde,": 151,
  "clorinde?": 152,
  "collei": 153,
  "collei,": 154,
  "collei?": 155,
  "compare": 156,
  "compound-bow": 157,
  "cool-steel": 158,
  "crane-s-echoing-call": 159,
  "crescent-pike": 160,
  "crimson-moon-s-semblance": 161,
  "crit.": 162,
  "cyno": 163,
  "cyno,": 164,
  "cyno?": 165,
  "dark-iron-sword": 166,
  "deathmatch": 167,
  "debate-club": 168,
  "dehya": 169,
  "dehya,": 170,
  "dehya?": 171,
  "dialogues-of-the-desert-sages": 172,
  "different": 173,
  "diluc": 174,
  "diluc,": 175,
  "diluc?": 176,
  "diona": 177,
  "diona,": 178,
  "diona?": 179,
  "dodoco-tales": 180,
  "dori": 181,
  "dori,": 182,
  "dori?": 183,
  "dragon-s-bane": 184,
  "dragonspine-spear": 185,
  "dull-blade": 186,
  "ebony-bow": 187,
  "elegy-for-the-end": 188,
  "emerald-orb": 189,
  "emilie": 190,
  "emilie,": 191,
  "emilie?": 192,
  "end-of-the-line": 193,
  "engulfing-lightning": 194,
  "eula": 195,
  "eula,": 196,
  "eula?": 197,
  "everlasting-moonglow": 198,
  "eye-of-perception": 199,
  "fading-twilight": 200,
  "faruzan": 201,
  "faruzan,": 202,
  "faruzan?": 203,
  "favonius-codex": 204,
  "favonius-greatsword": 205,
  "favonius-lance": 206,
  "favonius-sword": 207,
  "favonius-warbow": 208,
  "ferrous-shadow": 209,
  "festering-desire": 210,
  "fillet-blade": 211,
  "finale-of-the-deep": 212,
  "fischl": 213,
  "fischl,": 214,
  "fischl?": 215,
  "fleuve-cendre-ferryman": 216,
  "flowing-purity": 217,
  "focus": 218,
  "for": 219,
  "forest-regalia": 220,
  "freedom-sworn": 221,
  "freminet": 222,
  "freminet,": 223,
  "freminet?": 224,
  "frostbearer": 225,
  "fruit-of-fulfillment": 226,
  "furina": 227,
  "furina,": 228,
  "furina?": 229,
  "gaming": 230,
  "gaming,": 231,
  "gaming?": 232,
  "ganyu": 233,
  "ganyu,": 234,
  "ganyu?": 235,
  "gorou": 236,
  "gorou,": 237,
  "gorou?": 238,
  "hakushin-ring": 239,
  "halberd": 240,
  "hamayumi": 241,
  "haran-geppaku-futsu": 242,
  "harbinger-of-dawn": 243,
  "have": 244,
  "heizou": 245,
  "heizou,": 246,
  "heizou?": 247,
  "hu": 248,
  "hunter-s-bow": 249,
  "hunter-s-path": 250,
  "ibis-piercer": 251,
  "include": 252,
  "iron-point": 253,
  "iron-sting": 254,
  "is": 255,
  "itto": 256,
  "itto,": 257,
  "itto?": 258,
  "jadefall-s-splendor": 259,
  "jean": 260,
  "jean,": 261,
  "jean?": 262,
  "jin": 263,
  "jin,": 264,
  "jin?": 265,
  "kachina": 266,
  "kachina,": 267,
  "kachina?": 268,
  "kaedehara": 269,
  "kaeya": 270,
  "kaeya,": 271,
  "kaeya?": 272,
  "kagotsurube-isshin": 273,
  "kagura-s-verity": 274,
  "kamisato": 275,
  "katsuragikiri-nagamasa": 276,
  "kaveh": 277,
  "kaveh,": 278,
  "kaveh?": 279,
  "kazuha": 280,
  "kazuha,": 281,
  "kazuha?": 282,
  "keqing": 283,
  "keqing,": 284,
  "keqing?": 285,
  "key-of-khaj-nisut": 286,
  "king-s-squire": 287,
  "kinich": 288,
  "kinich,": 289,
  "kinich?": 290,
  "kirara": 291,
  "kirara,": 292,
  "kirara?": 293,
  "kitain-cross-spear": 294,
  "klee": 295,
  "klee,": 296,
  "klee?": 297,
  "kokomi": 298,
  "kokomi,": 299,
  "kokomi?": 300,
  "kujou": 301,
  "kuki": 302,
  "lan": 303,
  "layla": 304,
  "layla,": 305,
  "layla?": 306,
  "light-of-foliar-incision": 307,
  "lion-s-roar": 308,
  "lisa": 309,
  "lisa,": 310,
  "lisa?": 311,
  "lithic-blade": 312,
  "lithic-spear": 313,
  "lost-prayer-to-the-sacred-winds": 314,
  "lumidouce-elegy": 315,
  "lumine": 316,
  "lumine,": 317,
  "lumine?": 318,
  "luxurious-sea-lord": 319,
  "lynette": 320,
  "lynette,": 321,
  "lynette?": 322,
  "lyney": 323,
  "lyney,": 324,
  "lyney?": 325,
  "magic-guide": 326,
  "mailed-flower": 327,
  "makhaira-aquamarine": 328,
  "mappa-mare": 329,
  "mavuika": 330,
  "mavuika,": 331,
  "mavuika?": 332,
  "me": 333,
  "memory-of-dust": 334,
  "messenger": 335,
  "mika": 336,
  "mika,": 337,
  "mika?": 338,
  "miko": 339,
  "miko,": 340,
  "miko?": 341,
  "missive-windspear": 342,
  "mistsplitter-reforged": 343,
  "mitternachts-waltz": 344,
  "mona": 345,
  "mona,": 346,
  "mona?": 347,
  "moonpiercer": 348,
  "mouun-s-moon": 349,
  "mualani": 350,
  "mualani,": 351,
  "mualani?": 352,
  "nahida": 353,
  "nahida,": 354,
  "nahida?": 355,
  "navia": 356,
  "navia,": 357,
  "navia?": 358,
  "neuvillette": 359,
  "neuvillette,": 360,
  "neuvillette?": 361,
  "nilou": 362,
  "nilou,": 363,
  "nilou?": 364,
  "ningguang": 365,
  "ningguang,": 366,
  "ningguang?": 367,
  "noelle": 368,
  "noelle,": 369,
  "noelle?": 370,
  "oathsworn-eye": 371,
  "old-merc-s-pal": 372,
  "on": 373,
  "options.": 374,
  "ororon": 375,
  "ororon,": 376,
  "ororon?": 377,
  "otherworldly-story": 378,
  "pocket-grimoire": 379,
  "polar-star": 380,
  "polearm": 381,
  "portable-power-saw": 382,
  "predator": 383,
  "primordial-jade-cutter": 384,
  "primordial-jade-winged-spear": 385,
  "prospectors-drill": 386,
  "prototype-amber": 387,
  "prototype-archaic": 388,
  "prototype-crescent": 389,
  "prototype-grudge": 390,
  "prototype-malice": 391,
  "prototype-rancour": 392,
  "prototype-starglitter": 393,
  "qiqi": 394,
  "qiqi,": 395,
  "qiqi?": 396,
  "quartz": 397,
  "raiden": 398,
  "rainslasher": 399,
  "range-gauge": 400,
  "raven-bow": 401,
  "razor": 402,
  "razor,": 403,
  "razor?": 404,
  "recommended": 405,
  "recurve-bow": 406,
  "redhorn-stonethresher": 407,
  "region": 408,
  "region,": 409,
  "region?": 410,
  "rightful-reward": 411,
  "roles:": 412,
  "rosaria": 413,
  "rosaria,": 414,
  "rosaria?": 415,
  "royal-bow": 416,
  "royal-greatsword": 417,
  "royal-grimoire": 418,
  "royal-longsword": 419,
  "royal-spear": 420,
  "rust": 421,
  "sacrificial-bow": 422,
  "sacrificial-fragments": 423,
  "sacrificial-greatsword": 424,
  "sacrificial-jade": 425,
  "sacrificial-sword": 426,
  "sangonomiya": 427,
  "sapwood-blade": 428,
  "sara": 429,
  "sara,": 430,
  "sara?": 431,
  "sayu": 432,
  "sayu,": 433,
  "sayu?": 434,
  "scion-of-the-blazing-sun": 435,
  "seasoned-hunter-s-bow": 436,
  "serpent-spine": 437,
  "sethos": 438,
  "sethos,": 439,
  "sethos?": 440,
  "sharpshooter-s-oath": 441,
  "shenhe": 442,
  "shenhe,": 443,
  "shenhe?": 444,
  "shikanoin": 445,
  "shinobu": 446,
  "shinobu,": 447,
  "shinobu?": 448,
  "shogun": 449,
  "shogun,": 450,
  "shogun?": 451,
  "should": 452,
  "sigewinne": 453,
  "sigewinne,": 454,
  "sigewinne?": 455,
  "silver-sword": 456,
  "skyrider-greatsword": 457,
  "skyrider-sword": 458,
  "skyward-atlas": 459,
  "skyward-blade": 460,
  "skyward-harp": 461,
  "skyward-pride": 462,
  "skyward-spine": 463,
  "slingshot": 464,
  "snow-tombed-starsilver": 465,
  "solar-pearl": 466,
  "song-of-broken-pines": 467,
  "song-of-stillness": 468,
  "splendor-of-tranquil-waters": 469,
  "staff-of-homa": 470,
  "staff-of-the-scarlet-sands": 471,
  "sucrose": 472,
  "sucrose,": 473,
  "sucrose?": 474,
  "summit-shaper": 475,
  "sword": 476,
  "sword-of-descension": 477,
  "talking-stick": 478,
  "tao": 479,
  "tao,": 480,
  "tao?": 481,
  "tartaglia": 482,
  "tartaglia,": 483,
  "tartaglia?": 484,
  "tell": 485,
  "the": 486,
  "the-alley-flash": 487,
  "the-bell": 488,
  "the-black-sword": 489,
  "the-catch": 490,
  "the-dockhands-assistant": 491,
  "the-first-great-magic": 492,
  "the-flute": 493,
  "the-stringless": 494,
  "the-unforged": 495,
  "the-viridescent-hunt": 496,
  "the-widsith": 497,
  "they": 498,
  "thoma": 499,
  "thoma,": 500,
  "thoma?": 501,
  "thrilling-tales-of-dragon-slayers": 502,
  "thundering-pulse": 503,
  "tidal-shadow": 504,
  "tighnari": 505,
  "tighnari,": 506,
  "tighnari?": 507,
  "tome-of-the-eternal": 508,
  "toukabou-shigure": 509,
  "traveler": 510,
  "traveler,": 511,
  "traveler-s-handy-sword": 512,
  "traveler?": 513,
  "tulaytullah-s-remembrance": 514,
  "twin-nephrite": 515,
  "ultimate-overlord-s-mega-magic-sword": 516,
  "uraku-misugiri": 517,
  "uses": 518,
  "various": 519,
  "venti": 520,
  "venti,": 521,
  "venti?": 522,
  "verdict": 523,
  "vortex-vanquisher": 524,
  "wanderer": 525,
  "wanderer,": 526,
  "wanderer?": 527,
  "wandering-evenstar": 528,
  "waster-greatsword": 529,
  "wavebreaker-s-fin": 530,
  "weapons": 531,
  "what's": 532,
  "whereas": 533,
  "while": 534,
  "white-iron-greatsword": 535,
  "white-tassel": 536,
  "whiteblind": 537,
  "who": 538,
  "windblume-ode": 539,
  "wine-and-song": 540,
  "wish": 541,
  "with": 542,
  "wolf-fang": 543,
  "wolf-s-gravestone": 544,
  "wriothesley": 545,
  "wriothesley,": 546,
  "wriothesley?": 547,
  "xiangling": 548,
  "xiangling,": 549,
  "xiangling?": 550,
  "xianyun": 551,
  "xianyun,": 552,
  "xianyun?": 553,
  "xiao": 554,
  "xiao,": 555,
  "xiao?": 556,
  "xilonen": 557,
  "xilonen,": 558,
  "xilonen?": 559,
  "xingqiu": 560,
  "xingqiu,": 561,
  "xingqiu?": 562,
  "xinyan": 563,
  "xinyan,": 564,
  "xinyan?": 565,
  "xiphos-moonlight": 566,
  "yae": 567,
  "yan": 568,
  "yan,": 569,
  "yan?": 570,
  "yanfei": 571,
  "yanfei,": 572,
  "yanfei?": 573,
  "yaoyao": 574,
  "yaoyao,": 575,
  "yaoyao?": 576,
  "yelan": 577,
  "yelan,": 578,
  "yelan?": 579,
  "yoimiya": 580,
  "yoimiya,": 581,
  "yoimiya?": 582,
  "yun": 583,
  "zhongli": 584,
  "zhongli,": 585,
  "zhongli?": 586
}